{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "**Задача 1**\n",
        "\n",
        "Напишите программу, которая получает на ввод n строк, состоящих из двух слов разделенных пробелом, и выводит сгруппированные элементы по второму слову, и отсортированные по алфавиту. Разделите каждую группу при помощи строки <->."
      ],
      "metadata": {
        "id": "kVUw7oY7Nzf_"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "dyDnDyQeNptM"
      },
      "outputs": [],
      "source": [
        "from itertools import groupby\n",
        "from operator import itemgetter\n",
        "n = int(input())\n",
        "cities = []\n",
        "\n",
        "for i in range(n):\n",
        "    cities.append(input().split())\n",
        "\n",
        "result = []\n",
        "cities.sort(key=itemgetter(1,0))\n",
        "for country, cities in groupby(cities, key=itemgetter(1)):\n",
        "    result.append('\\n'.join([f\"{i[1]} {i[0]}\" for i in cities]))\n",
        "print(\"\\n<->\\n\".join(result))"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "#  решение со словарем\n",
        "d = {}\n",
        "\n",
        "for _ in range(int(input())):\n",
        "    city, country = input().split()\n",
        "    d.setdefault(country, []).append(city)\n",
        "\n",
        "res = ['\\n'.join(f'{co} {ct}' for ct in sorted(d[co])) for co in sorted(d)]\n",
        "print(*res, sep='\\n<->\\n')\n",
        "\n"
      ],
      "metadata": {
        "id": "51dEHjOOOC43"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "d= {}\n",
        "for _ in range(int(input())):\n",
        "     value, key = input().split()\n",
        "     d.setdefault(key, []).append(value) # создаём словарь где ключ страны а знвчение список городов, метод setdefault работает так - создаётся ключ, а значение по умолчанию у него пустой словарь и в словарь добавляется значение\n",
        "sort_d = dict(sorted(d.items(), key=lambda x: x[0])) # сортируем страны по алфавиту\n",
        "for key, value in sort_d.items(): # получаем ключ(страна) значение(список городов)\n",
        "    for i in sorted(value): # проходим по списку от сортированных городов (7 тест)\n",
        "        print(key, i)\n",
        "    if key != list(sort_d.keys())[-1]: # проверяем если ключ(страна) не равны последнему значению из списка(список ключей(стран) из словоря то печатаем разделитель, а если страна у нас последняя то разделитель не печатаем\n",
        "        print('<->')"
      ],
      "metadata": {
        "id": "5jByK4alOZg3"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "**bisect**\n",
        "\n",
        "Этот модуль очень полезен, если нужно часто вставлять элементы в отсортированный список. При этом не требуется постоянно сортировать массив после вставки. Производительность вставки – (O(n)).\n",
        "\n",
        "Плюсом так же является тот факт, что поиск элементов осуществляется за логарифмическое время (алгоритм бинарного поиска)."
      ],
      "metadata": {
        "id": "PgyguOQHN_iX"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import bisect\n",
        "\n",
        "a = [1, 3, 4, 4, 4, 6, 7]\n",
        "# Найти место для вставки справа\n",
        "print(bisect.bisect(a, 4)) # 5\n",
        "\n",
        "# Найти место для вставки слева\n",
        "print(bisect.bisect_left(a, 4)) # 2\n",
        "\n",
        "# вставить элемент\n",
        "bisect.insort(a,5)\n",
        "print(a) # [1, 3, 4, 4, 4, 5, 6, 7]"
      ],
      "metadata": {
        "id": "fncL4ebfOrel"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "**Задача 2**\n",
        "\n",
        "Сначала вашей программе на вход поступает поток чисел. Сохраните их в массиве в отсортированном виде. После ключевого слова \"change\" меняется состояние программы, и на каждое введенное число она должна выдавать индекс элемента, на котором находится данное число (правый). Программа завершается, когда встречает слово \"close\"."
      ],
      "metadata": {
        "id": "VAbAxgKmxU98"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import bisect\n",
        "\n",
        "a = []\n",
        "\n",
        "while (n := input()) != \"change\":\n",
        "    bisect.insort(a, int(n))\n",
        "while (n := input()) != \"close\":\n",
        "    print(bisect.bisect(a, int(n))-1)"
      ],
      "metadata": {
        "id": "QwfpMfhtxYGj"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "**Задача 3**\n",
        "\n",
        "Напишите программу, которая будет заменять символы строки на другую раскладку клавиатуры. Программа должна работать в обе стороны."
      ],
      "metadata": {
        "id": "lHU9x1V_xeEq"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "eng_layout = \"qwertyuiop[]asdfghjkl;'zxcvbnm,.`\"\n",
        "rus_layout = \"йцукенгшщзхъфывапролджэячсмитьбюё\"\n",
        "s = input()\n",
        "if s[0] in eng_layout:\n",
        "    table = str.maketrans(eng_layout, rus_layout)\n",
        "else:\n",
        "    table = str.maketrans(rus_layout, eng_layout)\n",
        "print(s.translate(table))"
      ],
      "metadata": {
        "id": "oykkXCjCxmMx"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}